
//&НаКлиенте
//Процедура Сохранить(Команда)
//	Если Не СохранитьНаСервере() Тогда 
//		Сообщить("Заполните все поля!");
//	Иначе 
//	ЭтаФорма.Закрыть();	
//	КонецЕсли;	
// 
// 
//КонецПроцедуры


&НаСервере
Процедура РазбитьАдрес()
Адрес = Объект.Адрес;	
СимволПоиска = ":";	
НомерСимвола = СтрНайти(Адрес,СимволПоиска);

IPАдрес	= Лев(Адрес,НомерСимвола - 1);
Порт = Сред(Адрес,НомерСимвола + 1);
КонецПроцедуры	


&НаСервере
Функция  СохранитьНаСервере()
	
	ЗаполненПользователь = Истина;
	ЗаполненПароль = Истина;
	ЗаполненАдрес = Истина;
	ЗаполненноИмяСервера = Истина;
	ЗаполненноНаименование = Истина;
	//Если Не ЗначениеЗаполнено(СокрЛП(НаборКонстант.Пользователь)) Тогда 
	//	 ЗаполненПользователь = Ложь;
	//КонецЕсли;
	//
	//Если Не ЗначениеЗаполнено(СокрЛП(НаборКонстант.Пароль)) Тогда 
	//	 ЗаполненПароль = Ложь;
	//КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СокрЛП(Объект.Наименование)) Тогда 
		ЗаполненноНаименование = Ложь;
	КонецЕсли;

	
	Если Не ЗначениеЗаполнено(СокрЛП(IPАдрес)) Или Не ЗначениеЗаполнено(СокрЛП(Порт)) Тогда 
		ЗаполненАдрес = Ложь;
	КонецЕсли;
	
	
	Если Не ЗначениеЗаполнено(СокрЛП(Объект.НаименованиеВебСервера)) Тогда 
		ЗаполненноИмяСервера = Ложь;
	КонецЕсли;
	
	Если Не ЗаполненПользователь Или Не ЗаполненПароль Или Не ЗаполненАдрес Или Не ЗаполненноИмяСервера Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	//Константы.Пользователь.Установить(НаборКонстант.Пользователь);
	//Константы.Пароль.Установить(НаборКонстант.Пароль);
	//Константы.Адрес.Установить(IPАдрес + ":" + Порт);
	//Константы.НаименованиеВебСервера.Установить(НаборКонстант.НаименованиеВебСервера);
	
	Объект.Адрес = IPАдрес + ":" + Порт;
	
	Возврат Истина;
	
	
КонецФункции	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//НаборКонстант.Адрес = Константы.Адрес.Получить();
	//НаборКонстант.НаименованиеВебСервера = Константы.НаименованиеВебСервера.Получить();
	//НаборКонстант.Пароль = Константы.Пароль.Получить();
	//НаборКонстант.Пользователь = Константы.Пользователь.Получить();
	
	РазбитьАдрес();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Не СохранитьНаСервере() Тогда 
		Сообщить("Заполните все поля!");	
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
