
Процедура ПередЗаписью(Отказ)
	Если Основная Тогда 
	ТаблицаБаз = ПолучитьОсновнуюБазу();
	
	Для Каждого Стр Из ТаблицаБаз Цикл 		
		Сообщить("В приложении уже выбрана основная база!",СтатусСообщения.Внимание);
		Отказ = Истина;
	КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьОсновнуюБазу()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИнформационныеБазы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ИнформационныеБазы КАК ИнформационныеБазы
	               |ГДЕ
	               |	ИнформационныеБазы.Основная
	               |	И ИнформационныеБазы.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);			   
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Возврат Выборка;
	
КонецФункции	
