
&НаКлиенте
Процедура Монитор(Команда)
	
	ИБ = ПолучитьОсновнуюБазу();
	
	Если Не ЗначениеЗаполнено(ИБ) Тогда 
		ИБ = ОткрытьФормуМодально("Справочник.ИнформационныеБазы.ФормаВыбора");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИБ) Тогда 
		Сообщить("ИБ не выбрана! Дальнейшая работа не возможна!");
		Возврат;
	КонецЕсли;	
	
	СтрутураПараметров = Новый Структура;
	СтрутураПараметров.Вставить("ИБ",ИБ);
	
	ОткрытьФорму("Обработка.Монитор.Форма.Форма",СтрутураПараметров);
КонецПроцедуры

&НаСервере
Функция ПолучитьОсновнуюБазу()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИнформационныеБазы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ИнформационныеБазы КАК ИнформационныеБазы
	               |ГДЕ
	               |	ИнформационныеБазы.Основная";
  Выборка = Запрос.Выполнить().Выбрать();
  
  Если Запрос.Выполнить().Пустой() Тогда 
	 Возврат Справочники.ИнформационныеБазы.ПустаяСсылка(); 
  КонецЕсли;	  
  
  Выборка.Следующий();
  
  Возврат Выборка.Ссылка;
	
КонецФункции	


&НаКлиенте
Процедура Настройки(Команда)
	ОткрытьФорму("Справочник.ИнформационныеБазы.ФормаСписка");
КонецПроцедуры
