
//&НаКлиенте
//Процедура Сохранить(Команда)
//	Если Не СохранитьНаСервере() Тогда 
//		Сообщить("Заполните все поля!");
//	Иначе 
//	ЭтаФорма.Закрыть();	
//	КонецЕсли;	
// 
// 
//КонецПроцедуры


//&НаСервере
//Процедура РазбитьАдрес()
//Адрес = Константы.Адрес.Получить();	
//СимволПоиска = ":";	
//НомерСимвола = СтрНайти(Адрес,СимволПоиска);

//IPАдрес	= Лев(Адрес,НомерСимвола - 1);
//Порт = Сред(Адрес,НомерСимвола + 1);
//КонецПроцедуры	


//&НаСервере
//Функция  СохранитьНаСервере()
//	
//	ЗаполненПользователь = Истина;
//	ЗаполненПароль = Истина;
//	ЗаполненАдрес = Истина;
//	ЗаполненноИмяСервера = Истина;
//	
//	//Если Не ЗначениеЗаполнено(СокрЛП(НаборКонстант.Пользователь)) Тогда 
//	//	 ЗаполненПользователь = Ложь;
//	//КонецЕсли;
//	//
//	//Если Не ЗначениеЗаполнено(СокрЛП(НаборКонстант.Пароль)) Тогда 
//	//	 ЗаполненПароль = Ложь;
//	//КонецЕсли;
//	
//	Если Не ЗначениеЗаполнено(СокрЛП(IPАдрес)) Или Не ЗначениеЗаполнено(СокрЛП(Порт)) Тогда 
//		ЗаполненАдрес = Ложь;
//	КонецЕсли;
//	
//	Если Не ЗначениеЗаполнено(СокрЛП(НаборКонстант.НаименованиеВебСервера)) Тогда 
//		ЗаполненноИмяСервера = Ложь;
//	КонецЕсли;
//	
//	Если Не ЗаполненПользователь Или Не ЗаполненПароль Или Не ЗаполненАдрес Или Не ЗаполненноИмяСервера Тогда 
//		Возврат Ложь;
//	КонецЕсли;
//	
//	Константы.Пользователь.Установить(НаборКонстант.Пользователь);
//	Константы.Пароль.Установить(НаборКонстант.Пароль);
//	Константы.Адрес.Установить(IPАдрес + ":" + Порт);
//	Константы.НаименованиеВебСервера.Установить(НаборКонстант.НаименованиеВебСервера);
//	
//	Возврат Истина;
//	
//	
//КонецФункции	

//&НаСервере
//Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//	
//	//НаборКонстант.Адрес = Константы.Адрес.Получить();
//	НаборКонстант.НаименованиеВебСервера = Константы.НаименованиеВебСервера.Получить();
//	НаборКонстант.Пароль = Константы.Пароль.Получить();
//	НаборКонстант.Пользователь = Константы.Пользователь.Получить();
//	
//	РазбитьАдрес();
//	
//КонецПроцедуры
